[{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "RTWF9WBI6UMQG",
  "text": "This is the second pair of echo buds I have owned. I love that I can effortlessly pair to 2 devices and switch to calls or music really easy. I used these for personal on my phone and also on my work laptop for calls and meetings. Pairing is quick and connection is great. Con: as I stated this is my 2nd pair and now my last. This pair lasted me 1 year nearly to the day. My 1st had lasted almost a year. I figured it was me that broke them but when I only have these in a secure spot in my backpack and the both mysteriously stop turning on and do not show signs of accepting a charge, I wonder if it is a pattern. Before I left work last week, they turned on, they were charged and the base led indicator turned on. Fast forward, the unit indicator won't come on, the buds won't make a sound or pair and when plugged in. I don't get a charging light to turn on either. First pair had the same problem. I take care of my tech. I still own my first ps1 and old nes systems and all still work. Real bummer these only lasted 1 year for me and have a common issue at least for me with becoming dead/broken after only 1 year.",
  "date": "Reviewed in the United States on September 3, 2025",
  "rating": "1.0 out of 5 stars",
  "title": "Okay at first",
  "userName": "M. Soulliere",
  "numberOfHelpful": 0,
  "variationId": "B09JVCL7JR",
  "imageUrlList": null,
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R3JUNCI0TA0NOJ",
  "text": "ANOTHER UPDATE: Whelp, I bought a second pair on August 25th, and here we are on November 27th and THIS pair is now USELESS. Same exact issue. Everyone says they can barely hear me, I sound like I'm trapped at the bottom of a tin can. These buds are COMPLETE TRASH. Customer service is useless. UPDATED REVIEW: Customer service reached out to me with instructions for update the software as well as doing a factory reset. I tried both of these actions, and it did not help. I called a friend, and she could hear me fine for about a minute, and then she said it sounded like I was talking through a tube or a tin can. So I am taking these down to one star because they are trash the died after only six months of use. ORIGINAL TWO-STAR REVIEW: I bought these because they looked a lot like Apple AirPods which are the only types of headphones that comfortably fit my ears. Every other type with the rounded buds feels like they're plugging my ears up, and I hate that feeling. When I first got them, they were great. They paired easily, they were comfortable, and the sound quality was adequate for the price. Almost six months to the day I purchased them, they suddenly started having issues. Coworkers on calls said I sounded like I was in another room. At first, I thought it was my Teams app, but then I had the same issues on a regular phone call. I thought, \"Oh, well, it was nice while it lasted. At least I can still use them to listen to audio while working out.\" I just connected them to my Samsung TV and they were so staticky and unstable, it was hurting my ears. These things are now basically a brick. Amazon used to make good devices. I have 1st Generation Amazon Echos that are STILL working fine after 8.5 years. Per usual, Amazon sacrificed quality and durability to make a higher profit. Way to go. Should have known it was too good to be true. It's too bad Apple AirPods have about the same life expectancy because they are the only other headphones that don't hurt my ears.",
  "date": "Reviewed in the United States on May 8, 2024",
  "rating": "1.0 out of 5 stars",
  "title": "Loved Them At First; Six Months Later, They Are USELESS",
  "userName": "Michael",
  "numberOfHelpful": 8,
  "variationId": "B09JVCL7JR",
  "imageUrlList": null,
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R3EISCARH58WZC",
  "text": "Original post: Lu-Lu-LUVVV THE FIT!!! (Updated), I’ve been reading the reviews and seeing the pros and cons and some are saying they don’t like the fit; but I’m guessing that’s bc bodies are all different. If you like AirPod second gen, this is better than that! They are secure AF! I have not tried it without the sleeve yet. No need. I hate the typical silicone rounded earbud tip; they irritate my ears and make them feel wet and slimy so when I saw these coming out (AND FOR THE PRICE!!!) I had to take a chance on them. I got these yesterday. I always sleep with an airpod in. These did not slip out while I slept!!! That’s incredible. I’m always searching for the AirPod in the middle of the night. For this price point…. Don’t change a THING! Who cares about the case? I’m saving big dollars and getting the closest to an airpod. Maybe even better. Here’s a couple of things that need improvement: they connect to other devices willy nilly and it drives me bananas. I had to take away a star for that. Even after forgetting other devices, it would still start to play on that other device. A real mess. The sound never gets as loud as I want it to be but that’s earbuds in general. Update: Man. These suck. I was so excited at this price and with this shape. I will say the battery life on the buds is good. Here’s things I doing like: - The ear recognition is just not there. They’ll even keep playing in the case. - Comfort: I sleep with mine on and they’re just bulkier fitting thanksgiving an airpod. If you move, they’ll move in a way that the sounds goes faint. You need to adjust to hear normally again. -Initially they never slipped then they were slipping all the time. I took the silicone off and that helped. -Connectivity oh the WORST of all the features of these. Do you want it to connect to something? It will not. Do you ABSOLUTELY NOT EVER want to connect to something? Oh then they are like 2 teenagers in love, you absolutely cannot keep them apart!!! They take over any time something else is on Alexa. Even if you’re not they’re. The worst.",
  "date": "Reviewed in the United States on June 29, 2023",
  "rating": "1.0 out of 5 stars",
  "title": "Updated again 👎👎",
  "userName": "bonco33013",
  "numberOfHelpful": 31,
  "variationId": "B09JVCL7JR",
  "imageUrlList": [
    "https://m.media-amazon.com/images/I/812kYjF9OPL._SY88.jpg"
  ],
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R2JQIPYCCRH7S",
  "text": "This is generic headphones, amazon flavor. It’s cheap and poorly made. Despite all this, they decided to make them “smart” but because it’s so cheap, it makes it even dumber. The shape of the headphones are so comically bad, that it’s always slipping out. Wouldn’t be such an issue if one of the “smart” features was pressing the headphones to pause it. So every time you readjust, your music gets paused. On top of that, there’s an inconsistent delay in your presses anywhere from 1-5 seconds, sometimes you think it didn’t work so you tap it again, only for it to start and stop your music. Speaking of pausing music, another “smart” feature, is if you drop a headphone (which will happen constantly) it “conveniently” pauses your music till you put it back on. Annoyingly enough, if you only want to use one headphone, because the case itself is so cheap, it keeps opening in your pocket slightly, activating the other headphone, and because it’s not in your ear, it pauses your music. Constantly. It frustrated me to the point that in a fit of anger, I tossed one headphone out of my window. Stopped the pausing. Forget the quality of the headphones, they’re cheap $20, skullcandies sound better. I would be fine with that if it wasn’t for all the other annoying headache, a cheap POS headphone should NOT have all these features, because the hardware is incompatible. Needing to download alexa as well, complete waste of money. I would rather burn $20 than buy another pair. DO NOT BUY IT FOR $50, $35, $20, EVEN $5. You could not pay me to use these pieces of garbage. I threw the case and other headphone down the sewer, so it can be surrounded by the crap it’s made from and the company it came from.",
  "date": "Reviewed in the United States on March 26, 2025",
  "rating": "1.0 out of 5 stars",
  "title": "Cheap but “smart” features makes it even dumber",
  "userName": "Consumer",
  "numberOfHelpful": 5,
  "variationId": "B09JVCL7JR",
  "imageUrlList": null,
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R1DVXBF8Z89M98",
  "text": "I bought this product in Prime Day in July 2024. Initially it was possible to pair it to my son's phone and a second device. He was very happy with his Alexa Buds and used them for a few days. After a few days one of the earpieces stopped working. In order to fix it I unpaired it and paired it again, but it was not easy and required trying for half hour. My son continued using them but after a few months I asked him why we wasn't using them. He had since switched to another phone and was unable to connect it to the new phone. It was disconnected from the old phone and secondary device. But impossible to put in pairing mode. I reached out in the support forums where the issue was present but there was no solution for the issue. They told me to reach out to customer support. I spent about an hour talking to 2 different customer representatives who told me nothing new and nothing that worked. Finally they told me a tech representative would reach out to me the next day help me fix it or arrange a replacement. I'm still waiting. So, summarizing: the product is impossible to put in pairing mode, forcing to use the Alexa app is the most ridiculous requirement for a product like this and nothing works as it's supposed to. On top of it customer support is useless, clueless and untrustworthy. It's the first time I am this disappointed with an Amazon product and its customer support, which until now have been quite satisfactory. I will steer clear of Amazon's devices from now on, just in case. And if an Amazon product only has 4 stars it's probably for a good reason.",
  "date": "Reviewed in the United States on February 14, 2025",
  "rating": "1.0 out of 5 stars",
  "title": "Incredibly flawed product with terrible customer support",
  "userName": "E. P.",
  "numberOfHelpful": 0,
  "variationId": "B09JVCL7JR",
  "imageUrlList": null,
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R1DTX1CW4LPM5E",
  "text": "Update: purchased July 2023. Earbuds have stopped working. Pro: - easy setup (I updated my Alexa app prior to setup as it enabled additional features) - stay in very well even when active - less expensive than most options I was considering - good, clear sound (I'm not a base person, so if you like to crank the base, I can't speak to the quality of that) - Alexa Hands-Free is very responsive (I tested in my home, so I was whispering since I didn't want to activate my other Alexa device nearby) - ability to change Tap Controls to something that is easy to remember for me - Tap seems fairly responsive - can change preferences for podcasts, music, and news (default is Amazon, but you can change, such as I changed my default for podcasts to my Spotify instead) - come with a spare set of covers (I will probably lose these tiny contacts-looking buddies by the time I need them, but hey, still nice) *I do prefer Hands-Free and like that this is an option because I find it uncomfortable to poke something into my ear every time I want to skip a song or turn up the volume Con: - fits better in my left ear than my right, my right becomes a bit uncomfortable after wearing for a bit - same problem I have with my boyfriend's older gen AirPods, though I will say these stay in better than the AirPods (all ears are different, so it has been trial and error to find a pair I like that are comfortable, but don't fall out... I do wish they had a marshmallow memory foam earbud option, but alas, most companies don't offer this) - not a con for me since my Samsung charger works for this, but these do not come with a charger so you may need to buy one separately *I've only had these for a couple days, so I will update if something goes wrong",
  "date": "Reviewed in the United States on July 18, 2023",
  "rating": "1.0 out of 5 stars",
  "title": "Pro Con List",
  "userName": "AnneOfLyon",
  "numberOfHelpful": 4,
  "variationId": "B09JVCL7JR",
  "imageUrlList": [
    "https://m.media-amazon.com/images/I/61aM3Jt3qjL._SY88.jpg",
    "https://m.media-amazon.com/images/I/61gjJ7zxRGL._SY88.jpg",
    "https://m.media-amazon.com/images/I/71CIxc2LWML._SY88.jpg",
    "https://m.media-amazon.com/images/I/71cltGKtoBL._SY88.jpg"
  ],
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R3UWEXU7JF3GD5",
  "text": "Not happy with the purchase. These don't fit well. They can't be adjusted other than a second super-thin cover that you can put on. I won't make this mistake again. I'll stick with Soundcore and JBL headsets instead of trying new things. On the positive side, I have a nice white cube paper weight that only cost $50. 🤪 update: 1/4/2024 - Since I couldn't return them, I figured I'd use them when I'm around the house, not doing anything physical. (i.e. listening to a book in bed, working on my computer, etc.) The fit hasn't improved and I almost lost one in the toilet when it chose that moment to pop out, but it's beyond a bad physical design. These things are even bad at Bluetooth and the controls are overly sensitive. On Bluetooth, sometimes they randomly drop if I pause a book and then won't start again. You can place them in the back in the carrier for 15-30 seconds and hope they connect when you pull them out, but that's not a sure thing. I've found that in the Bluetooth controls that the audio is turned off and the calls are turned on when this happens, but if you try to turn audio on manually, it immediately slides back to off. If you turn off calls, then most of the time, the audio will allow itself to be enabled. There is something basic wrong with these. The controls are super sensitive. If I put the bud in holding the longer base, sometimes, it starts playing my podcast or book. When I itch my ear, my podcast or book turns off with the lightest of touch on the side of the bud. I feel like I threw my money away.",
  "date": "Reviewed in the United States on December 13, 2023",
  "rating": "1.0 out of 5 stars",
  "title": "Not good",
  "userName": "Jeffery Smith",
  "numberOfHelpful": 5,
  "variationId": "B09JVCL7JR",
  "imageUrlList": null,
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R1UKFYIMLIC0UZ",
  "text": "I was so excited about these Echo Buds. I loved my first pair so much that I decided to buy a second one, and for a while, everything was great. But this time around, things took a turn for the worse. After not even a month of use, they simply stopped charging. It's incredibly frustrating and so disappointing. This is just the latest in a string of recent Amazon purchases that have had to be returned due to poor quality. I've honestly lost confidence in the brand, and it makes me feel guilty just thinking about starting yet another return process. It's sad because I really wanted to love these, but now I'm back on the hunt for a better, more reliable pair of headphones.",
  "date": "Reviewed in the United States on September 10, 2025",
  "rating": "1.0 out of 5 stars",
  "title": "From Favorite Buds to a Disappointing Return (?)",
  "userName": "Flying_Squad",
  "numberOfHelpful": 0,
  "variationId": "B09JVCL7JR",
  "imageUrlList": null,
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R39L3QS20O2BBN",
  "text": "Be aware! You are required to set your location settings to “always” and are forced to turn the microphone on just to set up the earbuds. Amazon doesn’t care about your privacy at all. They just want to stalk you and target you with ads. I can’t speak about the quality of the product itself because I didn’t even get it set up. The mandatory privacy settings are a deal breaker for me. There certainly are much less intrusive ear buds out there that are reasonably priced. Anker for one! And they sound great!! I only got these as a back up—not worth it.",
  "date": "Reviewed in the United States on August 25, 2025",
  "rating": "1.0 out of 5 stars",
  "title": "PRIVACY INTRUSIVE",
  "userName": "Victoria Brasfield",
  "numberOfHelpful": 0,
  "variationId": "B09JVCL7JR",
  "imageUrlList": null,
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVCL7JR",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Glacier White",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 329,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R2W0TAGL72UWJD",
  "text": "These are terrible for the price. They come with covers that are lubricated and also act as a spacer similar to how other manufacturers include different size spacers. I lost one and can't find a replacement. The sound is ok, but microphone for sound is terrible for calls. I have to disable Bluetooth after I pick up a call to be able to communicate, these are problems that should happen a decade ago, not with the latest advancements. Wait for a deal on another brand and pay a similar price for a better product. Edit: This product does not power on or charge a week after my warranty period has expired. I called support and all they offered me was a measly fifteen percent off the next product. This is the first time a genuine product has broken so quickly. Stay far away from the product.",
  "date": "Reviewed in the United States on July 8, 2025",
  "rating": "1.0 out of 5 stars",
  "title": "Terrible even at the low cost",
  "userName": "Colin",
  "numberOfHelpful": 0,
  "variationId": "B09JVCL7JR",
  "imageUrlList": null,
  "variationList": [
    "Color: Glacier White",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R1IB0SCNMHJ51O",
  "text": "I won't comment on the sound quality, which is fine. Or the battery life, which is just ok. I'm writing this review strictly based on the usability of these ear buds and the decisions the amazon team has made, which make these a real struggle to use in everyday life. To be clear, these ear buds are absolutely horrible. I wouldn't recommend them to anyone for anything. I've had a good number of bluetooth earbuds since they first arrived on the scene. I've had genuine Apple, Jabra and a few others. Some costing a few hundred dollars. Surprisingly, two of my most enduring sets are the absolute cheapest lesser known brands like a pair of JL Labs I think I paid $25 for and a pair of \"E18\" from some China brand. I think I paid $20 for those. So where do these Amazon ear buds fall short? Let's start with the fit. The fit is so poor, it makes me wonder how this was the final design to be greenlit by the product management. Both of my cheap buds stay in the ears better than these. These Amazon buds are constantly falling out, constantly needing to be repositioned in the ear. The little earbud condoms that are included do actually help to give the earbuds some more \"grip\", but they seem to quickly and easily find their way off of the earbuds to be lost forever. Luckily they do ship with a few condoms but that doesn't compensate for the poor design. Next, let's talk about the REQUIREMENT to use an app to pair them or to change the settings on earbuds. To the designers of this major fail, let me impress upon you the correct way that earbud pairing should work: 1.) Turn on the earbuds (put them into pairing mode if they're not smart enough to figure they're not paired) 2.) Go into your phone settings 3.) Go to bluetooth 4.) Find the earbuds 5.) Pair them That's it. There shouldn't be any requirements beyond the above. That consulting advice was free but I'll accept a consulting fee or even better, a full refund. Finally let's focus on the tap controls and the fact that they absolutely refuse to be disabled. One of side-effects of the poor fit is that the earbuds are constantly needing to be repositioned in the ear. Doing this with tap controls enabled becomes a real balancing act. This means that half the time you try and reposition the earbuds, you're likely to trigger the tap controls. Which leads me to my next gripe ... The Alexa app does give you the capability to disable the tap controls. Unfortunately these settings do absolutely nothing to actually disable the tap controls. It's nice that someone thought to include the tap controls but they should have gone the extra mile to ensure the disable settings actually work. A side effect of not being able to disable the tap controls is that the tap control REALLY want to control Apple Music. If you're listening to something other than Apple Music, you won't be for long if you mistakenly activate the tap controls. Any use of the tap controls causes Apple Music to wake up and take over playback from whatever's playing. Suuuper annoying. There's much more to dislike about these earbuds, but I'd like this to read like a review and now a book, so I'll just leave it at my top 3 reasons to stay away from these earbuds. To recap: * Poor fit * Alexa App Required * Tap controls refuse to disable * Tap (or slight rub) will activate Apple Music, no matter what you were listening to If you still buy these earbuds after reading this review, don't say I didn't warn you.",
  "date": "Reviewed in the United States on November 10, 2024",
  "rating": "1.0 out of 5 stars",
  "title": "Don't say I didn't warn you",
  "userName": "Customer Review",
  "numberOfHelpful": 449,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R4H4O34BGTKR0",
  "text": "So much is wrong with these ! 1. Most uncomfortable earbuds I have ever had the misfortune to use. And no way to rectify. And even if you could deal with the pain, they do not stay in. Per the instructions “… not to be placed inside ear , but lay them “ you can remove the super thin silicone cover “ for roomier fit” btw, no difference 2. You have to link them to the Alexa app, which constantly unlinks itself, this takes a lot of time, especially when you have to do this several times a day! 3. The sound constantly goes in and out of one or both earbuds! I have had this happen with other earbuds but it’s usually because I am outside the range of the Bluetooth and goes away as soon as I’m back in range.. NOT THESE! I am holding my phone!!! If the phone is not in your pocket it disconnects all together! 4) finally , the reason I tried these was for the Alexa integration… it’s useless. Doesn’t respond to any commands, if it does you have to repeat it 5-7 times and the commands are VERY limited! It can only control a small amount of apps, nothing for audiobooks. I wanted to be able to make announcements to the Alexa’s in the home while I was in the yard working,I wanted to use Alexa to turn on and off lights , etc. you can’t. Ans there is no feedback from Alexa in your earbud to know that the command failed or was successful.I wanted be hands free on pausing, rewind, fast forward , adjust volume hands free , you should be able to but Alexa is so unreliable that you just use your hands ( which defeats the whole purpose when my hands are dirty or full!) Also the find the earbuds/ case does NOT work at all, shows no location. Says they are working on a sound to be played to locate , but that was 2 years ago so I call BS. I even tried to give them to my teens who will gladly use any earbuds and go through them like water… they tried them and said thanks but no thank you, too uncomfortable, and the intermittent loss of sound was too frequent to be useful. Epic fail… Amazon charges for returns now so I think they count on that to keep returns low.",
  "date": "Reviewed in the United States on July 30, 2025",
  "rating": "1.0 out of 5 stars",
  "title": "Complete garbage! Dollar store buds are better!",
  "userName": "Proud Momma to 4",
  "numberOfHelpful": 7,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R3CY7EM6P7HXEJ",
  "text": "TERRIBLE!! In order to use this EarPods you have to download the Alexa app, which is stupit!! I bought these ear buds for my daughter to use for school on their school notebook. The school will not allow her to download any apps so these became useless for the purpose I purchased for. Why are they not able to simply be used with Bluetooth?!?!? So I thought I could just connect them to her phone to use. Again, I had to download the app, and as is everything with Alexa and Amazon, they want all your personal information. I was unable to connect to her phone because Alexa wanted access to her microphone on her phone, and I was not going to allow Alexa access to literally record and hear everything that she says! And because I would not allow Alexa to have access to her microphone I was unable to use the EarPods because it would not allow me to proceed past that point. Alexa says allow use for the microphone to communicate with your EarPods, her iPhone has Seri, she doesn’t need to “communicate” with her EarPods, they are EarPods. Why there is not a bypass option is beyond me, and if there was a bypass option it was not easily identifiable for me to proceed without first granting Alexa access to the microphone on her phone. SOOOOO STUPIT!!!!!!!’",
  "date": "Reviewed in the United States on August 26, 2025",
  "rating": "1.0 out of 5 stars",
  "title": "YA WHAT A TOTAL WASTE OF MY MONEY!!!",
  "userName": "Michael",
  "numberOfHelpful": 0,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R26DKM6O8LOYF9",
  "text": "TL;DR EXTREMELY UNCOMFORTABLE. Always feels like they're falling out. Fall out regularly. Don't fit human ears. Alexa integration finicky. Vastly inferior to Gen 2. All reviews about poor fit are understatements. Recently lost my Gen 2 Echo Buds figured I'd grab these as an inexpensive replacement. As a direct comparison I'm not sure what Tolkien-esq fantasy proto-humanoid/extra terrestrial species these were designed for but it wasn't designed for humans. Two sets of silicone covers are included (previous model included 4 color coded ear pieces)- neither helped, only made the fit even worse. No matter how I twist, turn, push and wiggle them I can't get them to feel like they \"fit\" - feels like I'm jamming Legos into my ears. I'm not an ENT, but I think my ears are average for a man of my height and weight. They are simply too odd shaped to fig snugly. The design choice is strange. I've never had such a bizarre experience with getting ear phones, presumably designed for the ears, to fit into my ears. The design choice is so strange - I wouldn't recommend these to anyone unless you have massive dog-sized audio cavities and intend on only standing still while listening to media. It's such a shame because when pressing them firmly into place the sound quality is excellent especially for such an inexpensive, lightweight package. Most disappointingly, using the wakeword typically does not work. I have two echos in my home, have used echo auto, use amazon music on my mobile daily and have owend the previous generation echo buds, but have never had to scream \"Alexa\" so many times to and nothing happen. It simply doesn't work, which is a shame. The main reason I chose these over any of the other myriad wireless buds on the market is because of the Alexa integration. I used my Gen 2 buds for arduous hands free activities hiking, running, riding my motorcycle, yard work etc. They'd fit great, there was a fit test in the setup, and Alexa, despite her flaws, worked great. Even at high speeds on my bike the old buds would hear the wakeword and get the request spot on, going through audio logs my voice can be heard crisply and clearly over the wind noise- for these? Forget it. I can't even get that far. Buy the previous generation. Unless you're standing still, they'll fall out of your ears, if you can get them in in the first place. If I'm some kind of anatomical anomaly I'll accept that but these aren't for me.",
  "date": "Reviewed in the United States on July 17, 2023",
  "rating": "1.0 out of 5 stars",
  "title": "Not designed for Human Ears",
  "userName": "Lucas Jaramillo",
  "numberOfHelpful": 91,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R2D35H0RYOZCZM",
  "text": "I use ear buds to listen to audio books and converse on telephone calls. I very rarely listen to music so audio fidelity is not important to me. I go for durability, ease of use, cost and staying in my ear. I have purchased half a dozen sets of ear buds in the last several years and usually pay less than $30. These cost $37 which makes them the costliest pair I have purchased. Sadly, they are, by far, the worst. I paid the higher price just because I thought it would be nice to access the Alexa collective. I may have not understood how to deal with the Alexa functions but the only function I was able to use was invoking it with the Alexa keyword. I would get tones when some Alexa notification or reminder occurred but not explanation or clue what it was. It seems that the vast majority of ear buds now use touches rather than buttons for victim interfacing. I was never able to get these ear buds to do anything but beep when I touched the bleeping things. The simplest thing to do with less horrible ear buds is to start and stop playback. These would never do that; just beep at me. These fall out my ears regularly. I even purchased the ‘anti-slip ear covers.’ They did not help. My other ear buds fall out on rare occasions, but these fall out with regularity. For that reason, used them sparingly and only when I was working around the house. I purchased these almost exactly a year ago and I have been meaning to warn the unsuspecting public about these. What finally triggered this review is that they are now totally inoperative. It appears the batty/charge pod is dead. The charge light does not come on nor will the ear buds connect to my phone. This finally allows me to rid myself of this sad and bad experiment. I strongly suggest that you avoid buying these. There are far better low-cost ear buds available.",
  "date": "Reviewed in the United States on December 30, 2024",
  "rating": "1.0 out of 5 stars",
  "title": "The worst ear buds I have ever purchased - don't waste your money or time",
  "userName": "Don Vickers",
  "numberOfHelpful": 8,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R2NKUDKP3OGWG9",
  "text": "Before considering purchasing this along with a 2-year warranty covering the device, please read EVERYTHING carefully. The insurance company is a third party vendor and Amazon DOES NOT honor the warranty. I spent nearly two hours on a phone call with multiple representatives within their call center structure. I was condescended to, placed on hold for extended periods of time repeatedly. I was asked repeatedly for verification of the order details that I was reading from their system and to provide product serial or DCN numbers from the product. At one point, a representative suggested that the product that I thought was “new” when I made the purchase suggested that they were “second hand”. The listing was for new Echo Buds and a “2-year warranty/policy” to cover the product. I was asked to provide images of the product three different times on the same call. Told that a tech company needed jpegs vs. the original file type I sent. When they received the images, they were unable to verify the information. The third representative informed me repeatedly that they were discussing this with leadership in multiple departments. After nearly two hours, I was told the only thing they could do was to offer a refund on the Echo Buds (2023 version) and not offer a replacement. In order to get the vendor to honor the replacement, I would need to call the manufacturer directly. This was a terrible experience from start to finish. If this were another era, I would say I will not shop with them anymore but the sad reality is that they and other big tech companies control our lives. I do not recommend purchasing this to cover the Echo Bud product. When their editors refuse to post this review, I will resubmit again. This was not worth the experience at all I enjoyed this product before it randomly stopped working and simply wanted a replacement product with the coverage I purchased.",
  "date": "Reviewed in the United States on August 3, 2024",
  "rating": "1.0 out of 5 stars",
  "title": "If they had negative number ratings, that would not be low enough.",
  "userName": "Jonathan Webb",
  "numberOfHelpful": 26,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R30S99VB6XAOV8",
  "text": "I was excited when I saw these more affordable Amazon ear buds were coming. I was tempted by the initial cost. I really want to use Alexa more (I have 2 echos and fitbit versa 2 with Alexa and on my phone and tablet and use Amazon unlimited music) but Alexa continues to disappoint and these ear buds don't do anything to improve my opinion. I got the 1st ear buds when they came out like 2019 and they were ok but Alexa was difficult to work with then too and then the buds stopped playing audio well...I don't remember playing music too loudly but they broke(?)...Like back in the day when you blew your speakers and there was a crackling static sound...that's what they sound like now. I purchased some by Tozo here on Amazon to replace them that work really well and charge wirelessly and are noise dampening and I should have stuck with them. I still use them now in fact. The new amazon ear buds sound about the same as those...maybe slightly better; slightly. Both types have fallen out of my ears once or twice. Not just when jogging either. One of the new Amazon buds fell into a sink of water while I was washing my hands but it still works fine. They hurt my ears just a little after a while and that has never happened with any other ear bud. Alexa though...the main reason I was so excited; is sketchy at best. It will stop accepting commands at times. Will not do anything. It will try to play Spotify when I have Amazon music and have it selected in all possible ways as my one and only or default source. It is cumbersome at best (to safe more space here)...I kind of wish I could get my money back and just use the Tozo. I don't know if I can keep trying to use Alexa when the tech seems stagnant and broken and here in the onset of the era of A.I. Over all I had to reevaluate the buds themselves and add another star. Nothing special and disappointing considering I already had good ear buds but serviceable especially if you are not moving a lot and decent sound quality that may barely exceed a lesser brand's Update... 10/30/23 these worthless earbuds sometimes only 1 charges! And I'm connected to my phone then it tries to connect with my tv(?!) and the result is it's \"still connected\" to my phone but makes no sounds! Uncomfortable garbage!",
  "date": "Reviewed in the United States on July 18, 2023",
  "rating": "1.0 out of 5 stars",
  "title": "Don't expect much",
  "userName": "Amazon Customer",
  "numberOfHelpful": 20,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R17NO6LC6LGU55",
  "text": "I bought two sets of these earbuds in May of 2023. One set went to my wife, and I caried the other set. They were used very gently. I used them for probably four ours each week, keeping them in my shirt pocket (in their case) when not in use, and connected to a charger at night. They were OK. The Alexa integration never worked well. They were very finicky about when they would work, and often, Alexa would interrupt me in the middle of a request to tell me that she \"didn't get that\". As regular Bluetooth earbuds, they were fine. Volume was good, and sound quality was passible. I had them paired to my phone, and to two laptops. Switching between devices was a little cumbersome (I had to manually connect to them through the devices' Bluetooth settings almost every single time) but it worked. They were no more flaky than the $30 set I'd bought at Home Depot years earlier. Unfortunately, today, in late June of 2024, I pulled them from my pocket to find them completely dead. No lights. No sounds. No nothing. All troubleshooting available on Amazon's website failed. They're just dead. They were eligible for replacement under warranty until two weeks ago. They died less than 14 days outside of their warranty period. To be fair, I hadn't used them in the last three days, or so, so they might have crapped out even closer to the finish line. Whichever engineer did the planned obsolescence on this one nailed it. I'd consider earbuds that are functional for just over one year to be essentially disposable, and that's revolting.",
  "date": "Reviewed in the United States on June 21, 2024",
  "rating": "1.0 out of 5 stars",
  "title": "Disposable garbage.",
  "userName": "Michael R.",
  "numberOfHelpful": 16,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R1516H9GKZ2X0B",
  "text": "Definition of Doing too much. While listening to music from my phone these headphones constantly cut off and Alexa will say no longer connected to network. And pause music even tho I have full bars or connected to wi-fi and my phone next to me. Which is weird that I can’t listen to downloaded music on my phone if I don’t have network? When I’m listening to music at work and someone talks to me and I take an ear bud out the music pauses which is fine and automatically continues when you put them back in. The part that sucks about it is if I’m on pandora take them off it’ll pause continue when I put them back on but then changes apps and play a random song from Apple Music. Which of course with earbuds they do randomly fall out and then the apps switch. I will also be listening to music the ear buds will cut off and turn back on and Alexa will say welcome open the Alexa app for set up even tho they are already paired with my phone. So I have to setup again but the Alexa app while trying to pair will say unable to pair go to Bluetooth setting and forget these earbuds so we can repair to the same earbuds. At one point I did have these connected to my two house TVs which are both amazon fire TVs and even tho on the alex app I have the automatically pair to tv option off they still pair to my TVs if I open the earbud cases. I really regret these just need normal headphones all these features need to get worked out.",
  "date": "Reviewed in the United States on August 29, 2024",
  "rating": "1.0 out of 5 stars",
  "title": "Absolutely hate these",
  "userName": "Darren Cinco",
  "numberOfHelpful": 8,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
},
{
  "statusCode": 200,
  "statusMessage": "FOUND",
  "asin": "B09JVG3TWX",
  "productTitle": "Amazon Echo Buds (newest model), True Wireless Bluetooth 5.2 Earbuds with Alexa, audio personalization, multipoint, 20H battery with charging case, fast charging, sweat resistant, Black",
  "currentPage": 1,
  "sortStrategy": "helpful",
  "countReviews": 845,
  "domainCode": "com",
  "filters": {
    "filterByStar": "one_star",
    "reviewerType": "all_reviews",
    "mediaType": "all_contents",
    "formatType": "current_format"
  },
  "countRatings": 12604,
  "productRating": "3.8 out of 5",
  "reviewSummary": {
    "fiveStar": {
      "percentage": 53
    },
    "fourStar": {
      "percentage": 16
    },
    "threeStar": {
      "percentage": 11
    },
    "twoStar": {
      "percentage": 7
    },
    "oneStar": {
      "percentage": 13
    }
  },
  "reviewId": "R3T28XZZIZJP5U",
  "text": "The case died in less than 10 months and will no longer charge the earbuds. Waste of money. Update: Shortly after posting this one-star review above, I received a voicemail from 'Stephanie' who said she was from the Amazon Device Team wanting to discuss the issue. She said she would call back, but did not. I also got an email from 'Allison' saying I could contact them via a link in the email. The link took me to their customer service page and I tried to respond to them there. A few weeks later, I got another call, this time from Jason. This time I recognized the number and answered the phone. Jason said that Amazon recognized that there were some problems with a few of the Echo earbuds, and offered me a new pair, contingent on my sending the old ones back for analysis - If I agreed I could expect an email with instructions. I did agree right on that phone call, but no email ever arrived. No new earbuds arrived either. I called customer service to discuss, but the representative said it was \"impossible\" that I was contacted by them, and that they were probably not even Amazon employees. This was strange, as the number I used to call Amazon Customer Service was just a redial of the number Jason and Stephanie had contacted me from. So apparently I have no way to contact the device team, and I am wondering what on earth is going on. It is now 3 weeks since Jason's call but I am hoping Amazon fulfills Jason's promise of sending me a replacement if I send the non-working pair back.",
  "date": "Reviewed in the United States on August 12, 2024",
  "rating": "1.0 out of 5 stars",
  "title": "Useless after 10 months",
  "userName": "Live4Laughter",
  "numberOfHelpful": 6,
  "variationId": "B09JVG3TWX",
  "imageUrlList": null,
  "variationList": [
    "Color: Black",
    "Configuration: Device Only"
  ],
  "locale": null,
  "verified": true,
  "vine": false,
  "videoUrlList": []
}]